dimitrioskyranos/ee3-code/ESP32_Code/C_Code/latest/esp-final_v2/src/main.c
    #include <stdio.h>
    #include <string.h>
    #include "freertos/FreeRTOS.h"
    #include "freertos/task.h"
    #include "driver/spi_master.h"
    #include "esp_log.h"
    #include "driver/gpio.h"
    #include "nrf24.h"
    #include <stdint.h>
    #include <stddef.h>
    #include "driver/ledc.h"
    #include "esp_err.h"
    #include <math.h>
    #include "freertos/timers.h"  // Ensure this is included for xTimer*
    #include "driver/uart.h"
    #include "freertos/event_groups.h"
    #include "esp_system.h"
    #include "esp_event.h"
    #include "esp_wifi.h"
    #include "esp_netif.h"
    #include "esp_http_server.h"
    #include "nvs_flash.h"
    #include "sg90.h"
    
    #define IN1 7
    #define IN2 5
    #define ENA 6  // PWM channel 0
    // Motor B pins
    #define IN3 17
    #define IN4 15
    #define ENB 16  // PWM channel 1

    // PWM configuration
    #define PWM_FREQ 1000
    #define PWM_RES LEDC_TIMER_8_BIT
    #define MAX_DUTY_CYCLE 255


    //NRF CONFIG
    #define SPI_HOST       SPI2_HOST
    #define DMA_CHANNEL    0
    #define MOSI_PIN       13
    #define MISO_PIN       12
    #define SCLK_PIN       14
    #define CS_PIN         11
    #define CE_PIN         4
    #define IRQ_PIN        10 




//SERVO CONFIG
#define SERVO_X_PIN 42       // GPIO pin for Servo X
#define SERVO_Y_PIN 41       // GPIO pin for Servo Y
#define SERVO_Z_PIN 40
#define SERVO_GRAB 39 
#define SERVO_X_CHANNEL LEDC_CHANNEL_2  // PWM channel for Servo X
#define SERVO_Y_CHANNEL LEDC_CHANNEL_3  // PWM channel for Servo Y
#define SERVO_Z_CHANNEL LEDC_CHANNEL_4 
#define SERVO_G_CHANNEL LEDC_CHANNEL_7 

// Adjust how fast the servo moves (tune this value as needed)
#define SERVO_SPEED_SCALING 6  // Higher = faster movement

int servoX_pos = 10;  // Start neutral
int servoY_pos = 10;  // Start neutral
bool servoZ_toggled = false;
bool servoG_toggled = false;


sg90_servo_t servoX = { .channel = SERVO_X_CHANNEL, .timer = LEDC_TIMER_1, .speed_mode = LEDC_LOW_SPEED_MODE, .gpio_num = SERVO_X_PIN };
sg90_servo_t servoY = { .channel = SERVO_Y_CHANNEL, .timer = LEDC_TIMER_1, .speed_mode = LEDC_LOW_SPEED_MODE, .gpio_num = SERVO_Y_PIN };
sg90_servo_t servoZ = { .channel = SERVO_Z_CHANNEL, .timer = LEDC_TIMER_1, .speed_mode = LEDC_LOW_SPEED_MODE, .gpio_num = SERVO_Z_PIN };
sg90_servo_t servoG = { .channel = SERVO_G_CHANNEL, .timer = LEDC_TIMER_1, .speed_mode = LEDC_LOW_SPEED_MODE, .gpio_num = SERVO_GRAB };


typedef enum {
    WAIT_FOR_START,
    READ_SIZE,
    READ_IMAGE
} recv_state_t;

#define UART_NUM           UART_NUM_1
#define BUF_SIZE           (2048)
#define QUEUE_SIZE         (10)
#define START_SIGNAL       "IMG_START"
#define END_SIGNAL         "IMG_END"
#define MAX_IMAGE_SIZE     (1024 * 1024)  // 1MB max

#define WIFI_SSID          "iPhone - Dimitris"
#define WIFI_PASS          "123456789"

#define STATIC_IP          "172.20.10.4"
#define GATEWAY_IP         "172.20.10.1"
#define NETMASK_IP         "255.255.255.240"

// static const char *TAG = "UART_HTTP";

// Event groups
static EventGroupHandle_t s_wifi_event_group;
const int WIFI_CONNECTED_BIT = BIT0;
const int IMAGE_READY_BIT    = BIT1;

static esp_netif_t *netif = NULL;
static int reconnect_attempts = 0;

// Image storage
static QueueHandle_t uart_queue;
static uint8_t *image_buffer = NULL;
static uint8_t *last_image_buffer = NULL;
static int image_size = 0;
static int last_image_size = 0;
static int received_size = 0;
static esp_err_t post_image_handler(httpd_req_t *req);
static esp_err_t get_image_handler(httpd_req_t *req);

 



// Speaker Constants
#define SPEAKER_PIN 38
#define SWITCH_PIN 37
#define SPEAKER_RES LEDC_TIMER_10_BIT
#define SPEAKER_FREQ1 600
#define SPEAKER_FREQ2 900
#define SPEAKER_DUTY 512 
#define SPEAKER_CHANNEL LEDC_CHANNEL_5 
volatile bool siren_active = false;  // Flag to track button press state



TimerHandle_t nrf_timer;      // Declare the timer handle
    spi_device_handle_t spi;

    uint8_t TxAddress[] = {0xE7, 0xE7, 0xE7, 0xE7, 0xE7};
    uint8_t DataTx[] = "Hello, world";
    uint8_t RxData[32];
    volatile bool irq_triggered = false;
    volatile bool timer_ready = false;
    volatile bool siren_tick = false;
    TimerHandle_t siren_timer;
    bool switch_pressed;
    static const char *TAG = "SPI_MASTER";


    static esp_err_t test_get_handler(httpd_req_t *req) {
        const char* response = "✅ /test endpoint is working!";
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_send(req, response, HTTPD_RESP_USE_STRLEN);
        return ESP_OK;
    }


    static void wifi_event_handler(void *arg, esp_event_base_t event_base,
        int32_t event_id, void *event_data) {
        if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        esp_wifi_connect();
        } else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        reconnect_attempts++;
        ESP_LOGW(TAG, "Wi-Fi disconnected. Attempt #%d to reconnect...", reconnect_attempts);
        esp_wifi_connect();
        xEventGroupClearBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
        } else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
        ESP_LOGI(TAG, "Got IP Address: " IPSTR, IP2STR(&event->ip_info.ip));
        reconnect_attempts = 0;
        xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
        }
    }



static void wifi_init(void) {
    s_wifi_event_group = xEventGroupCreate();
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    netif = esp_netif_create_default_wifi_sta();

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                    &wifi_event_handler, NULL, NULL));
    ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                    &wifi_event_handler, NULL, NULL));

    wifi_config_t wifi_config = {
    .sta = {
    .ssid = WIFI_SSID,
    .password = WIFI_PASS
        }
    };

    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());
}

// HTTP handlers
static esp_err_t post_image_handler(httpd_req_t *req) {
    ESP_LOGI(TAG, "Received HTTP POST request at /image");

    if (last_image_buffer != NULL && last_image_size > 0) {
    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_send(req, (const char *)last_image_buffer, last_image_size);
    } else {
    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "No image found.");
    }
    return ESP_OK;
}

static esp_err_t get_image_handler(httpd_req_t *req) {
    httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate");

    ESP_LOGI(TAG, "Received HTTP GET request at /getimage");
    EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group, IMAGE_READY_BIT,
                        pdFALSE, pdTRUE, pdMS_TO_TICKS(5000));
    if ((bits & IMAGE_READY_BIT) == 0) {
    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Image not ready.");
    return ESP_OK;
    }

    if (last_image_buffer != NULL && last_image_size > 0) {
    httpd_resp_set_type(req, "image/jpeg");
    httpd_resp_send(req, (const char *)last_image_buffer, last_image_size);
    } else {
    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "No image found.");
    }
    return ESP_OK;
}

static void start_http_server(void) {
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    httpd_handle_t server = NULL;

