dimitrioskyranos/ee3-code/ESP32_Code/C_Code/latest/esp-final_v2/src/main.c
    if (httpd_start(&server, &config) == ESP_OK) {
    httpd_uri_t post_image_uri = {
    .uri = "/image",
    .method = HTTP_POST,
    .handler = post_image_handler,
    .user_ctx = NULL
    };
    httpd_register_uri_handler(server, &post_image_uri);

    httpd_uri_t get_image_uri = {
    .uri = "/getimage",
    .method = HTTP_GET,
    .handler = get_image_handler,
    .user_ctx = NULL
    };
    httpd_register_uri_handler(server, &get_image_uri);

    httpd_uri_t test_uri = {
        .uri = "/test",
        .method = HTTP_GET,
        .handler = test_get_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(server, &test_uri);

    ESP_LOGI(TAG, "HTTP server started successfully.");
    } else {
    ESP_LOGE(TAG, "Failed to start HTTP server!");
    }
}


static void uart_event_task(void *arg) {
    
    xEventGroupClearBits(s_wifi_event_group, IMAGE_READY_BIT);

    uart_event_t event;
    uint8_t *data = malloc(BUF_SIZE);
    static uint8_t temp_buffer[BUF_SIZE];
    static int temp_len = 0;
    recv_state_t state = WAIT_FOR_START;
    ESP_LOGI(TAG, "📥 UART task running...");
    while (1) {
        if (xQueueReceive(uart_queue, &event, pdMS_TO_TICKS(50))) {
            if (event.type == UART_DATA) {
                ESP_LOGI(TAG, "📡 UART received %d bytes", event.size);
                int len = uart_read_bytes(UART_NUM, data, event.size, pdMS_TO_TICKS(50));
                if (len > 0) {
                    if (temp_len + len >= BUF_SIZE) {
                        ESP_LOGW(TAG, "Buffer overflow. Resetting...");
                        temp_len = 0;
                        state = WAIT_FOR_START;
                        continue;
                    }
                    memcpy(temp_buffer + temp_len, data, len);
                    temp_len += len;
                }
            }
        }

        switch (state) {
            case WAIT_FOR_START: {
                char *start_ptr = (char *)memmem(temp_buffer, temp_len, START_SIGNAL, strlen(START_SIGNAL));
                if (start_ptr != NULL) {
                    int header_len = start_ptr - (char *)temp_buffer + strlen(START_SIGNAL);
                    memmove(temp_buffer, temp_buffer + header_len, temp_len - header_len);
                    temp_len -= header_len;
                    state = READ_SIZE;
                }
                break;
            }

            case READ_SIZE: {
                if (temp_len >= 4) {
                    image_size = temp_buffer[0] |
                                 (temp_buffer[1] << 8) |
                                 (temp_buffer[2] << 16) |
                                 (temp_buffer[3] << 24);

                    if (image_size <= 0 || image_size > MAX_IMAGE_SIZE) {
                        ESP_LOGE(TAG, "Invalid image size: %d", image_size);
                        temp_len = 0;
                        state = WAIT_FOR_START;
                        break;
                    }

                    if (image_buffer) free(image_buffer);
                    image_buffer = malloc(image_size);
                    if (!image_buffer) {
                        ESP_LOGE(TAG, "Failed to allocate image buffer");
                        state = WAIT_FOR_START;
                        break;
                    }

                    memmove(temp_buffer, temp_buffer + 4, temp_len - 4);
                    temp_len -= 4;
                    received_size = 0;
                    state = READ_IMAGE;
                }
                break;
            }

            case READ_IMAGE: {
                int copy_len = image_size - received_size;
                if (copy_len > temp_len) copy_len = temp_len;

                memcpy(image_buffer + received_size, temp_buffer, copy_len);
                received_size += copy_len;
                memmove(temp_buffer, temp_buffer + copy_len, temp_len - copy_len);
                temp_len -= copy_len;

                if (received_size == image_size) {
                    ESP_LOGI(TAG, "✅ Image fully received (%d bytes)", image_size);
                    if (last_image_buffer) free(last_image_buffer);
                    last_image_buffer = image_buffer;
                    last_image_size = image_size;
                    xEventGroupSetBits(s_wifi_event_group, IMAGE_READY_BIT);
                    image_buffer = NULL;
                    received_size = 0;
                    image_size = 0;
                    state = WAIT_FOR_START;
                }
                break;
            }
        }

        // vTaskDelay(pdMS_TO_TICKS(20));  // Yield
    }

    free(data);
    vTaskDelete(NULL);
}

static void uart_init(void) {
    uart_config_t uart_config = {
        .baud_rate = 250000,
        .data_bits = UART_DATA_8_BITS,
        .parity    = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE
    };
    uart_param_config(UART_NUM, &uart_config);
    uart_set_pin(UART_NUM, 8, 18, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    uart_driver_install(UART_NUM, BUF_SIZE * 4, BUF_SIZE * 4, QUEUE_SIZE, &uart_queue, 0);

    // Run UART task on Core 1
    xTaskCreatePinnedToCore(uart_event_task, "uart_event_task", 8192, NULL, 1, NULL, 1);
    ESP_LOGI(TAG, "UART initialized");
}

    
    void spi_initialization()
    {
        // SPI bus configuration
        spi_bus_config_t buscfg = {
            .mosi_io_num = MOSI_PIN,
            .miso_io_num = MISO_PIN,
            .sclk_io_num = SCLK_PIN,
            .quadwp_io_num = -1,
            .quadhd_io_num = -1,
            
        };

        // Initialize the SPI bus
        ESP_ERROR_CHECK(spi_bus_initialize(SPI_HOST, &buscfg, DMA_CHANNEL));

        // SPI device configuration
        spi_device_interface_config_t devcfg = {
            .clock_speed_hz = 500 * 1000, // Start with 500 kHz
            .mode = 0,                         // SPI Mode 0 (CPOL = 0, CPHA = 0)
            .spics_io_num = CS_PIN,            // CS pin
            .queue_size = 7, 
            .flags = SPI_DEVICE_NO_DUMMY,                        // MSB first (default)
        };

        // Add the SPI device
        ESP_ERROR_CHECK(spi_bus_add_device(SPI_HOST, &devcfg, &spi));

