dimitrioskyranos/ee3-code/ESP32_Code/C_Code/latest/esp-final_v2/src/main.c
        ESP_LOGI(TAG, "SPI Master initialized for NRF24L01");
    }

    void espNRFPins(){
         // config CS
        gpio_reset_pin(CS_PIN);
        gpio_set_direction(CS_PIN, GPIO_MODE_OUTPUT);
        // config CE
        gpio_reset_pin(CE_PIN);
        gpio_set_direction(CE_PIN, GPIO_MODE_OUTPUT);
        CS_unselect();
        CE_disable();
    }


void setup_switch() {
    gpio_config_t switch_conf = {
        .pin_bit_mask = (1ULL << SWITCH_PIN),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,  // Enable internal pull-up resistor
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&switch_conf);
}

    void setup_servo() {
    servo_init(&servoX);
    servo_init(&servoY);
    servo_init(&servoZ);
    servo_init(&servoG);


    servo_pos(&servoX, 10);  // Neutral (middle)
    servo_pos(&servoY, 10);  // Neutral (middle)
    servo_pos(&servoZ, 10);  // Neutral toggle position
    servo_pos(&servoG, 20);  // Neutral toggle position
}


    void setup_pwm() {
    // Configure PWM for Motor A
    ledc_timer_config_t ledc_timer = {
        .speed_mode       = LEDC_LOW_SPEED_MODE,
        .timer_num        = LEDC_TIMER_0,
        .duty_resolution  = PWM_RES,
        .freq_hz          = PWM_FREQ,
        .clk_cfg          = LEDC_AUTO_CLK
    };
    ledc_timer_config(&ledc_timer);

    ledc_channel_config_t motorA_channel = {
        .gpio_num   = ENA,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel    = LEDC_CHANNEL_0,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = 0,
        .hpoint     = 0
    };
    ledc_channel_config(&motorA_channel);

    // Configure PWM for Motor B
    ledc_channel_config_t motorB_channel = {
        .gpio_num   = ENB,
        .speed_mode = LEDC_LOW_SPEED_MODE,
        .channel    = LEDC_CHANNEL_1,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = 0,
        .hpoint     = 0
    };
    ledc_channel_config(&motorB_channel);
    
    }


    void setup_speaker(){
        ledc_timer_config_t speaker_timer = {
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .timer_num = LEDC_TIMER_2,  // Use a different timer for the servos
            .duty_resolution = SPEAKER_RES,
            .freq_hz = SPEAKER_FREQ1,
            .clk_cfg = LEDC_AUTO_CLK
        };
        ledc_timer_config(&speaker_timer);
        // Configure PWM channel for Servo X
        ledc_channel_config_t speaker_channel = {
            .gpio_num = SPEAKER_PIN,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = SPEAKER_CHANNEL,
            .timer_sel = LEDC_TIMER_2,
            .duty = 0,  // Start silent
            .hpoint = 0
        };
        ledc_channel_config(&speaker_channel);
    }




    void setup_gpio() {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << IN1) | (1ULL << IN2) | (1ULL << IN3) | (1ULL << IN4),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE
    };
    gpio_config(&io_conf);
    }


    void siren_task(void *arg) {
        uint32_t current_freq = SPEAKER_FREQ1;
    
        while (1) {
            if (siren_active) {
                // Toggle frequency between 2kHz and 3kHz
                current_freq = (current_freq == SPEAKER_FREQ1) ? SPEAKER_FREQ2 : SPEAKER_FREQ1;
                ledc_set_freq(LEDC_LOW_SPEED_MODE, LEDC_TIMER_2, current_freq);
                ledc_set_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL, SPEAKER_DUTY);  // Enable sound
                ledc_update_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL);
            } else {
                // Mute speaker when conditions are not met
                ledc_set_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL, 0);
                ledc_update_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL);
            }
            vTaskDelay(pdMS_TO_TICKS(400));  // Switch frequency every 400ms
        }
    }

   


    void set_motorA(bool forward, int speed) {
    gpio_set_level(IN1, forward ? 1 : 0);
    gpio_set_level(IN2, forward ? 0 : 1);
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0, speed);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_0);
    }

    void set_motorB(bool forward, int speed) {
    gpio_set_level(IN3, forward ? 1 : 0);
    gpio_set_level(IN4, forward ? 0 : 1);
    ledc_set_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1, speed);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, LEDC_CHANNEL_1);
    }


    void control_servoZ_toggle(uint8_t switch_value, sg90_servo_t *servo) {
        if (switch_value == 0xFF) {
            // Button released
            return;
        }
        else if (switch_value == 0x00) {
            // Button pressed -> toggle servo
            servoZ_toggled = !servoZ_toggled;
 
            int pos = servoZ_toggled ? 15 : 5;  // Example: open (position 5) / close (position 15)
            servo_pos(servo, pos);
        }
    }


    void control_servoG_toggle(uint8_t switch_value, sg90_servo_t *servo) {
        if (switch_value == 0xFF) {
            // Button released
            return;
        }
        else if (switch_value == 0x00) {
            // Button pressed -> toggle servo
            servoG_toggled = !servoG_toggled;
 
            int pos = servoG_toggled ? 20 : 1;  // Example: open (position 5) / close (position 15)
            servo_pos(servo, pos);
        }
    }
    


    void control_servo(uint8_t servo_value, sg90_servo_t *servo, int *current_pos) {
        if (servo_value == 0x80) {
            // Joystick is centered -> no movement
            return;
        }
    
        int step = (servo_value - 0x80) / SERVO_SPEED_SCALING;  // Calculate speed (can be negative)
    
        // Update the current position
        *current_pos += step;
    
        // Clamp between 1 and 20
        if (*current_pos < 1) *current_pos = 1;
        if (*current_pos > 20) *current_pos = 20;
    
        // Update servo
        servo_pos(servo, *current_pos);
    }



void control_motors(uint8_t x, uint8_t y) {
    int speedA = 0;
    int speedB = 0;
    bool forwardA = true;
    bool forwardB = true;

    // // Forward/Backward logic
    // if (y < 0x80) {
    //     // Joystick Up: Both motors move forward
    //     speedA = (0x80 - y) * 2; // Speed increases as y decreases
    //     speedB = (0x80 - y) * 2;
    //     forwardA = true;
    //     forwardB = true;
    // } else if (y > 0x80) {
    //     // Joystick Down: Both motors move backward
    //     speedA = (y - 0x80) * 2; // Speed increases as y increases
    //     speedB = (y - 0x80) * 2;
    //     forwardA = false;
    //     forwardB = false;
    // }

    // // Left/Right logic
    // if (x < 0x80) {
    //     // Joystick Left: Only Motor B moves forward
    //     speedA = 0; // Motor A is stopped
    //     speedB = (0x80 - x) * 2; // Speed increases as x decreases
    //     forwardA = true; // Doesn't matter since speedA is 0
    //     forwardB = true;
    // } else if (x > 0x80) {
    //     // Joystick Right: Only Motor A moves forward
    //     speedA = (x - 0x80) * 2; // Speed increases as x increases
    //     speedB = 0; // Motor B is stopped
    //     forwardA = true;
    //     forwardB = true; // Doesn't matter since speedB is 0
    // }

