dimitrioskyranos/ee3-code/ESP32_Code/C_Code/latest/esp-final_v2/src/main.c
    // // Ensure the speeds are within the valid range
    // speedA = (speedA < 0) ? 0 : (speedA > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedA;
    // speedB = (speedB < 0) ? 0 : (speedB > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedB;

    

    // // Set the motor speeds and directions
    // set_motorA(forwardA, speedA);
    // set_motorB(forwardB, speedB);



    if(y < 0x80 && x > 0x80){
        speedA = sqrt(pow((y - 0x80)*16, 2) + pow((x-0x80)*16, 2));
        speedB = (y - 0x80) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y < 0x80 && x < 0x80){
        speedA = (y - 0x80) * 16;
        speedB = sqrt(pow((y - 0x80)*16, 2) + pow((x-0x80)*16, 2));
        forwardA = false;
        forwardB = false;
       } else if(y > 0x80 && x < 0x80 ){
        speedA = sqrt(pow((0x80 - y)*16,2) + pow((x-0x80)*16,2));
        speedB = (120 - y) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y > 0x80 && x > 0x80){
        speedA = (0x80 - y) * 16;
        speedB = sqrt(pow((0x80 - y)*16,2) + pow((x-0x80)*16,2));
        forwardA = true;
        forwardB = true;
       } else if(y > 0x80){
        speedA = (y - 0x80) * 16;
        speedB = (y - 0x80) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y < 0x80){
        speedA = (0x80 - y) * 16;
        speedB = (0x80 - y) * 16;
        forwardA = false;
        forwardB = false;
       } else {
        speedA = 0;
        speedB = 0;
        forwardA = true;
        forwardB = true;
       }

           // // Ensure the speeds are within the valid range
     speedA = (speedA < 0) ? 0 : (speedA > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedA;
     speedB = (speedB < 0) ? 0 : (speedB > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedB;

    

     // Set the motor speeds and directions
     set_motorA(forwardA, speedA);
     set_motorB(forwardB, speedB);

}

void handle_nrf_data() {
    if (isDataAvailable(1) == 1) {
        NRF24_Receive(RxData);

        // Parse received data
        uint8_t joystickY = RxData[1];
        uint8_t joystickX = RxData[0];
        uint8_t servoX_data = RxData[2];
        uint8_t servoY_data = RxData[3];
        uint8_t servoSwitch = RxData[5];
        uint8_t grabButton = RxData[4];

        // Process movement
        control_motors(joystickX, joystickY);

        control_servo(servoX_data, &servoX, &servoX_pos);
        control_servo(servoY_data, &servoY, &servoY_pos);

        // 🛠 Toggle servo Z and Grab
        control_servoZ_toggle(servoSwitch, &servoZ);
        control_servoG_toggle(grabButton, &servoG);

        // Handle siren
        // switch_pressed = (gpio_get_level(SWITCH_PIN) == 0);  // LOW = pressed
        bool car_moving = (joystickX != 0x80 || joystickY != 0x80);
        siren_active = switch_pressed && car_moving;
    //     if (siren_active){
    //         ESP_LOGI(TAG,"Siren Active");
    //     }

    //     // Optional logging
       ESP_LOGI(TAG, "Joystick X: %d, Y: %d", joystickX, joystickY);
    //    ESP_LOGI(TAG, "Servo X: %d, Y: %d", servoX, servoY);
    }
}

void IRAM_ATTR nrf_irq_handler(void* arg) {
    irq_triggered = true;  // Set flag

}

void nrf_timer_callback(TimerHandle_t xTimer) {
    timer_ready = true;
}


void siren_timer_callback(TimerHandle_t xTimer) {
    siren_tick = true;
}   


void check_switch_toggle()
{
    bool current_state = gpio_get_level(SWITCH_PIN);  // Read switch state (HIGH or LOW)

    switch_pressed = (current_state == 0);  // LOW = switch ON (because pull-up is enabled)

    // Optional log if you want
    // ESP_LOGI(TAG, "Switch is now: %s", switch_pressed ? "ON" : "OFF");
}


    void app_main(void)
    {
        //catch everything on the serial monitor delay
        vTaskDelay(4000 / portTICK_PERIOD_MS);
        ESP_LOGE(TAG,"Start to control the motors over nrf24");    


        spi_initialization();
        setup_pwm();  // Initialize PWM
        setup_gpio(); //GPIO Pins init
        setup_servo();
        setup_speaker();
        setup_switch();

        




        espNRFPins();


        init_NRF();
        NRF24_RxMode(TxAddress, 122);
        gpio_config_t irq_config = {
            .pin_bit_mask = (1ULL << IRQ_PIN),
            .mode = GPIO_MODE_INPUT,
            .pull_up_en = GPIO_PULLUP_ENABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_NEGEDGE,  // Falling edge
        };
        gpio_config(&irq_config);
        gpio_install_isr_service(ESP_INTR_FLAG_LEVEL3);
        gpio_isr_handler_add(IRQ_PIN, nrf_irq_handler, NULL);
        
       
        if(isDataAvailable(1) == 1)
    {
        NRF24_Receive(RxData);
    }

    
    nrf_timer = xTimerCreate("nrf_timer", pdMS_TO_TICKS(50), pdTRUE, NULL, nrf_timer_callback);
    if (nrf_timer != NULL) {
        xTimerStart(nrf_timer, 0);
    } else {
        ESP_LOGE(TAG, "Failed to create NRF timer");
    }


    siren_timer = xTimerCreate("siren_timer", pdMS_TO_TICKS(400), pdTRUE, NULL, siren_timer_callback);
if (siren_timer != NULL) {
    xTimerStart(siren_timer, 0);
} else {
    ESP_LOGE(TAG, "Failed to create siren timer");
}
xTaskCreatePinnedToCore(siren_task, "siren_task", 2048, NULL, 1, NULL,0);


ESP_LOGI(TAG, "Starting application...");
    ESP_ERROR_CHECK(nvs_flash_init());
    wifi_init();
    ESP_LOGI(TAG, "Waiting for Wi-Fi...");
    xEventGroupWaitBits(s_wifi_event_group, WIFI_CONNECTED_BIT, pdFALSE, pdTRUE, portMAX_DELAY);
    start_http_server();
    uart_init();


        while(1)
        {
            check_switch_toggle();
            
            if (timer_ready && irq_triggered) {
                timer_ready = false;
                irq_triggered = false;
                // ESP_LOGI(TAG, "IRQ triggered!");  // Safe to print here
                handle_nrf_data();
                // You can call NRF24_Receive here if needed later
            }

                
            vTaskDelay(pdMS_TO_TICKS(20));
                
            
            
            
        }
    }

    uint8_t SPI_ByteExchange(uint8_t data) {
        uint8_t receivedByte = 0;

        spi_transaction_t trans = {
            .length = 8,            // 8 bits to send
            .tx_buffer = &data,     // Data to transmit
            .rx_buffer = &receivedByte, // Buffer for received data
        };

